[
  {
    "title": "A t-test evaluates whether the difference between two means is larger than what random variation alone would produce.",
    "categories": ["T-test"]
  },
  {
    "title": "There are three major types of t-tests: one-sample, independent samples, and paired samples.",
    "categories": ["T-test"]
  },
  {
    "title": "A one-sample t-test compares a sample mean against a known or hypothesized population mean.",
    "categories": ["T-test"]
  },
  {
    "title": "An independent samples t-test compares the means of two independent groups.",
    "categories": ["T-test"]
  },
  {
    "title": "A paired samples t-test compares the mean difference within the same individuals across two time points or conditions.",
    "categories": ["T-test"]
  },
  {
    "title": "The independence of observations is one of the most critical assumptions of all t-tests.",
    "categories": ["T-test", "Assumptions"]
  },
  {
    "title": "T-tests assume the dependent variable is continuous and approximately normally distributed within each group.",
    "categories": ["T-test", "Assumptions"]
  },
  {
    "title": "The independent t-test assumes equal variances across groups; if violated, use Welch’s t-test.",
    "categories": ["T-test", "Assumptions"]
  },
  {
    "title": "A significant t-test indicates evidence of a mean difference, not the magnitude or importance of that difference.",
    "categories": ["T-test", "Interpretation"]
  },
  {
    "title": "Effect sizes such as Cohen’s d, Hedges’ g, and Glass’s Δ provide insight into the practical importance of a t-test result beyond statistical significance.",
    "categories": ["T-test", "Effect Size"]
  },
  {
    "title": "Always report effect size with a t-test; statistical significance alone does not describe the practical impact.",
    "categories": ["T-test", "Effect Size"]
  },
  {
    "title": "In t-test, Cohen’s d measures how large the mean difference is in standardized units.",
    "categories": ["T-test", "Effect Size"]
  },
  {
    "title": "Confidence intervals surrounding the mean difference offer a clearer picture of the precision of your estimate.",
    "categories": ["T-test", "Confidence Interval"]
  },
  {
    "title": "A non-significant t-test does not prove that two groups are the same. It simply shows that the evidence is insufficient.",
    "categories": ["T-test", "Interpretation"]
  },
  {
    "title": "Larger sample sizes make t-tests more sensitive to detecting small but consistent differences.",
    "categories": ["T-test"]
  },
  {
    "title": "Before running a t-test, visualize the data; plots can reveal group differences or assumption violations not visible in the numbers.",
    "categories": ["T-test", "Data Visualization"]
  },
  {
    "title": "Report t-statistic, degrees of freedom, p-value, mean difference, and effect size for transparent communication.",
    "categories": ["T-test", "Reporting"]
  },
  {
    "title": "The robustness of t-tests increases with balanced group sizes and minimal outliers.",
    "categories": ["T-test"]
  },
  {
    "title": "Cohen’s d expresses the mean difference between two groups in standard deviation units, making the effect easy to interpret across studies.",
    "categories": ["T-test", "Effect Size"]
  },
  {
    "title": "Hedges’ g is a small-sample correction of Cohen’s d, providing a more accurate effect size when sample sizes are small or unequal.",
    "categories": ["T-test", "Effect Size"]
  },
  {
    "title": "Glass’s Δ uses only the standard deviation of the control group, making it useful when the two groups have very different variances.",
    "categories": ["T-test", "Effect Size"]
  },
  {
    "title": "Linear regression estimates how the expected value of an outcome changes with a one-unit change in a predictor."
  },
  {
    "title": "The goal of linear regression is not perfect prediction, but interpretable relationships between variables."
  },
  {
    "title": "Linear regression models conditional means, not individual outcomes."
  },
  {
    "title": "In linear regression, the intercept represents the expected outcome when all predictors equal zero."
  },
  {
    "title": "A linear regression coefficient quantifies average change while holding other predictors constant."
  },
  {
    "title": "In linear regression, residuals represent the portion of the outcome the model cannot explain."
  },
  {
    "title": "Linear regression assumes a systematic, linear relationship between predictors and the outcome."
  },
  {
    "title": "Independence in linear regression requires that observations do not influence one another."
  },
  {
    "title": "Homoscedasticity in linear regression means residual variance is constant across fitted values."
  },
  {
    "title": "In linear regression, normality is an assumption about residuals—not the original variables."
  },
  {
    "title": "Low multicollinearity in linear regression ensures each predictor contributes unique information."
  },
  {
    "title": "Linear regression assumptions are evaluated through diagnostics, not intuition."
  },
  {
    "title": "Residual plots are central to diagnosing assumption violations in linear regression."
  },
  {
    "title": "In linear regression, influential observations matter because they can substantially alter estimates."
  },
  {
    "title": "When linear regression is nonlinear, transformations or polynomial terms are often required."
  },
  {
    "title": "Heteroscedasticity in linear regression calls for robust standard errors or weighted least squares."
  },
  {
    "title": "Dependence in linear regression data requires clustered, mixed, or hierarchical modeling."
  },
  {
    "title": "Multicollinearity in linear regression is addressed through centering, variable selection, or dimension reduction."
  },
  {
    "title": "Outliers in linear regression should be investigated for meaning before any decision to remove them."
  },
  {
    "title": "Linear regression results should be reported with effect sizes, uncertainty, and context."
  },
  {
    "title": "Statistical significance alone is insufficient for interpreting linear regression results."
  },
  {
    "title": "All conclusions from linear regression are conditional on model specification and assumptions."
  }
]
